MENU = {
    '에스프레소' : {
        '재료':{
            '물' : 50,
            '커피' : 18,
        },
        '가격' : 1.5,
    },
    '라떼' : {
        '재료':{
            '물' : 200,
            '우유' : 150,
            '커피' : 24,
        },
        '가격' : 2.5,
    },
    '카푸치노' : {
        '재료':{
            '물' : 250,
            '우유' : 100,
            '커피' : 24,
        },
        '가격' : 3.5,
    },
}
profit = 0
resources = {
    '물' : 300,
    '우유' : 200,
    '커피' : 100,
}

num1, num2 = input('입력').split()
num1 = int(num1)
print(type(num1))
